using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WarThunderHuificator
{
    public static class ConstStrings
    {
        public static Dictionary<string, string> ReplacementsPreRegex = new Dictionary<string, string>()
        {
            ["Ми-4АВ"] = "♿⋡♿",
            ["Archer"] = "Archer♿",
            ["TURMS-T"] = "♿",
            ["В бой!"] = "В хуй!",
            //["2С3М"] = "2С-ГОТОВЬ СРАКУ-3М",
            ["БА-11"] = "еБАть-11",
            ["БМД-4"] = "БляМДа-4",
            //["2С38"] = "2СУКА38",
            //["2С6"] = "2СУКА6",
            //["ИТ-1"] = "",
            ["Т-55"] = "Т-55Anime",
            //["2C25"] = "2СУКА25",
            //["2C25М"] = "2СУКА25МРАЗЬ",
            //["Т-34"] = "Тэ-34",
            //["Т-44"] = "Тэ-44",
            //["Т-54"] = "Тэ-54",
            //["Т-55"] = "Тэ-55",
            //["Т-64"] = "Тэ-64",
            //["Т-50"] = "Тэ-50",
            //["Т-80"] = "Тэ-80",
            //["Т-28"] = "Тэ-28",
            //["Т-126"] = "Тэ-126",
            //["Т-10"] = "Тэ-10",
            //["Т-72"] = "Тэ-72",
            //["Т-62"] = "Тэ-62",
            //["Т-90"] = "Тэ-60",
            ["И-225"] = "ХУИ-225",
            ["И-185"] = "ХУИ-185",
            ["И-16"] = "ХУИ-16",
            ["И-15"] = "ХУИ-15",
            ["И-153"] = "ХУИ-153",
            ["И-180"] = "ХУИ-180",

        };
        public static Dictionary<string, string> ConstReplacements = new Dictionary<string, string>()
        {
            ["Покрышкина"] = "Хуекрышкина",
            ["СССР"] = "ХУЕССР",
            ["США"] = "ХУЕША",
            ["Як"] = "ХуЯк",
            ["Су"] = "Сука",
            ["Ла"] = "ХуиЛа",
            ["Ил"] = "ХуИл",
            ["Ту"] = "ХуиТу",
            ["Пе"] = "Педрила",
            ["МиГ"] = "ЖмыХ",
            ["СУ"] = "СУКА",
            ["ГАЗ"] = "ШИЗА",
            ["ДШК"] = "ДОШИК",
            ["ЗиС"] = "ЗаибиС",
            ["ЗИС"] = "ЗАИБИС",
            ["ЯГ"] = "ХУЯГ",
            ["КВ"] = "КАВО",
            ["АСУ"] = "АСУЖДАЮ",
            ["ПТ"] = "ХУЕПУТАЛО",
            ["ИС"] = "ПЕНИС",
            ["ИСУ"] = "П(ИСУ)ЗДЕЦ",
            ["ЗСУ"] = "ЗаСсУ",
            ["БТР"] = "БляТРахну",
            ["ПКТ"] = "ПуКаТь",
            ["БМП"] = "БляМнеПохуй",
            ["КПВТ"] = "КопроВТ",
            ["УК"] = "УКурок",
            ["НСВТ"] = "НаСуюВроТ",
            ["ФАБ"] = "ФАБЛЯДЬ",
            ["СКР"] = "СКР СКР СКР",
            ["Пр"] = "Пидор",
            ["МБК"] = "ХУЕМБиК",
            ["МПК"] = "ХУЕМПК",
            ["БМО"] = "БыдлоЧМО",
            ["МО"] = "ЧМО",
            ["ТИС"] = "ПИЗ",
            ["МА"] = "ДА",
            ["По"] = "Похуй",
            ["ДБ"] = "ДаБля",
            ["СБ"] = "СукаБлять",
            ["Ар"] = "пидАр",
            ["БТ"] = "БлятьТрактор",
            ["БМ"] = "Блять Ракетная Хуйня",
            ["ЗУТ"] = "ЖОПА ЧЕШЕТСЯ",
            ["Ка"] = "Какуля",
            ["Ми"] = "сяоМи",
            ["СМК"] = "СакМайКок",

        };
    }
}
